app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	def all_posts
		@post = Post.all

INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "qwe qwe qwe qw e"], ["created_at", "2017-04-01 11:13:00.780131"], ["updated_at", "2017-04-01 11:13:00.780131"]]
---
	def create
		@post = Post.new(post_params)
		if @post.save